label good_end_right:
    play sound door
    scene room_heronight with dissolve
    "Я радий, що вдалося все залагодити з Соломією"
    "Я ліг на ліжко"
    "Тієї ночі я не міг заснути. Мої думки були переповнені словами Соломії і тим, що вона розповіла мені" 
    "Її важке життя, її боротьба з сімейними проблемами, її рішучість і прагнення вирішити все самотужки..." 
    "Я зрозумів, що ми повинні бути разом. Незважаючи на труднощі, на всі ці перепони, ми повинні підтримувати одне одного"
    scene dark with dissolve

    centered"На наступний день ми зустрілися біля школи, як завжди, але щось було іншим"
    centered"Ми більше не просто друзі, ми стали чимось більшим. У її погляді я бачив ту ж саму турботу"
    centered"Але тепер вона була змішана з впевненістю, якої я не помічав раніше"
    centered"Пройшло пройшов рік"
    centered"Ми випустилися зі школи"
    centered"Трохи згодом ми вступили до одного університету"
    centered"Я пішов на менеджера, а Соломія хоче стати вчителькою"
    centered"Пройшло чимало часу, перш ніж я зміг перейти на новий рівень стосунків"


    #---------------------------------------------------------------------------------------------------------------
    #Універ

    scene bg house2night with dissolve
    show solomia2 blink with dissolve
    "Ми разом сідали на ту ж лавку, біля її будинку"
    "Я дивився на неї, відчуваючи, як у моєму серці знову розцвітає надія"
    "Зараз саме той час, коли ми станемо ще ближче"
    "Ви стиснули в кишені кільце, яке зараз подаруєте своїй коханій"
    h "Соломіє... Я знаю, що ми обидва маємо власні цілі, але хоч би що сталося, я хочу бути з тобою" 
    "Ти — моя мета. Я хочу йти через життя разом з тобою, як партнер, як підтримка"
    "Ви дістаєте з кишені гарно-оздоблене кільце з голубим сапфіром"
    "Як по класиці, стаєте на одне коліно та кажете ті самі слова"
    h "Скажи, ти вийдеш за мене?"
    show solomia2 smiled with dissolve
    "Вона посміхнулася, її очі засвітилися, і вона взяла мою руку"
    s "Я теж хочу цього. З тобою я почуваюся сильною, навіть якщо все навколо здається не таким простим"
    s "Звичайно, я згодна, зараз я нащайсливіша у світі"
    "Ми відчували, як наші серця билися в унісон, і це було більше, ніж просто любов — це була спільна мета, спільне прагнення до чогось кращого"
    "Я обережно одягнув кільце на її безіменний палець"
    "Трохи згодом ми зіграли весілля"
    hide solomia2 smiled with dissolve
    scene wedding with dissolve
    stop music fadeout 1.0
    play sound wedding
    "Ми запросили не дуже багатьох родичів"
    "З мого боку був лише батько, дивно, шо він взагалі приїхав"
    "Але мені на те було байдуже, адже, тепер у мене є найголовніша людина у житті"
    "Потім прозвучали ті слова, які я чекав дуже довго"
    show solomia_wedding_enhanced with dissolve
    "Прекрасні наші [h] та Соломія!"
    "Сьогодні очікувана й неповторна подія у вашому житті — сплітаються в одну дві долі"
    "Далі підете разом, переживаючи радощі та труднощі"
    "Складно знайти того, хто прийме і полюбить такого, як ти є. Усі ми різні, зважуємо плюси й мінуси інших"
    "Вам пощастило зустрітися, закохатися й донести свої почуття"
    "І ось тут, біля друзів та рідних, пролунають важливі запитання та відповіді"
    "Чи є ваше бажання одружитися вільним та щирим, чи готові залишатися поруч у радісні та сумні дні?"
    "Прошу відповісти Вас Соломіє"
    s "Так"
    "Яка Ваша відповідь, [h]?"
    
    menu wedding_yes:
        "Так":
            jump wedding2
        "Ні":
            "Було б кумедно сказати ні на це питання"
            "Та, яку ти любиш понад усе"
            "Заради якої ти віддаси все"
            "Я трохи посміявся, Соломія би мене ущипнула, якби я сказав ні"
            "Ми пройшли через дуже багато труднощів разом"
            "І я впевнений, що вона саме та, з ким я хотів би розділити своє життя"
            "Так, звичайно!"
            jump wedding2

    label wedding2:
    "Отже, за взаємною згодою ваш шлюб реєструється, залишилося поставити підписи"
    "Дорогі наречені!"
    "Шлюбними символами здавна були каблучки, які робили зі шкіри, дерева або бронзи. Вони говорили про вірність і кохання"
    "Запрошую Вас обмінятися обручками та завжди зберігати дані обіцянки"
    "З цієї миті ви сім’я, а дім ваш стане фортецею. Спільне вирішення життєвих задач робить її неприступною для всякої негоди"
    "А просто зараз я урочисто оголошую вас чоловіком та дружиною"
    "Наречений, можете поцілувати наречену"
    hide solomia wedding with dissolve
    play sound kiss1
    "Після того ми поцілувалися, як не цілувалися ще ніколи"
    $ play_random_playlist()
    "Зараз, згадуючи цей момент свого життя, я не зможу передати щастя, яке відчував в той момент"
    "Звичайно, у нас було ще багато перешкод на шляху, але..."
    "Ми підтримували одне одного, коли здавалося, що навколо все обрушується, і раділи успіхам, коли відчували, що робимо правильний крок"
    "Ночами, коли ми сиділи разом на ліжку, сміючись і обговорюючи свої мрії, я почувався, наче не було нічого важливішого за цю мить"
    "Я тримав її за руку, відчуваючи кожен дотик. І ми обидва знали, що, хоч майбутнє і невідоме, ми будемо разом"
    "Нічого не могло змінити наших почуттів"
    "І хоча ми з Соломією прийшли до важливого рішення"
    "Працювати разом над своїм майбутнім" 
    "Підтримувати один одного в кожному кроці, ми обидва знали, що є одна велика мета, яка нас об'єднує — це наша любов"
    scene black with dissolve
    if not achievement.has("wedding_ach"):  # Перевіряємо, чи досягнення ще не здобуте
        achieve wedding_ach
        play sound achievement

    centered"Скажи, [usID], на місці персонажа [h] ти теж хотів би мати наречену, як Соломія?"
    menu question4:
        "Цікаве питання, хіба ні?"
        "Так":
            "Ну тоді все в твоїх руках!"
        "Ні":
            "Або в тебе вже є та сама, або ти просто молодець"
            "Бо не всі люди можуть жити на самоті"
            "Людина — істота соціальна"
            "І кожному потрібен вірний товариш, друг чи помічник"
            "Подумай над цим..."
    "Дякую за проходження цієї візуальної новели!"
    "Сподіваюсь, ти пройдеш усі кінцівки та розблокуєш усі досягнення!"
    "З турботою, Ваш Розробник"
    return

