label good_end_right:
    play sound door
    scene room_heronight with dissolve
    "Я радий, що вдалося все залагодити з Соломією"
    "Я ліг на ліжко"
    "Тієї ночі я не міг заснути. Мої думки були переповнені словами Соломії і тим, що вона розповіла мені" 
    "Її важке життя, її боротьба з сімейними проблемами, її рішучість і прагнення вирішити все самотужки..." 
    "Я зрозумів, що ми повинні бути разом. Незважаючи на труднощі, на всі ці перепони, ми повинні підтримувати одне одного"
    scene dark with dissolve

    centered "На наступний день ми зустрілися біля школи, як завжди, але щось було іншим"
    centered "Ми більше не просто друзі, ми стали чимось більшим. У її погляді я бачив ту ж саму турботу"
    centered "Але тепер вона була змішана з впевненістю, якої я не помічав раніше"
    centered "Пройшло пройшов рік"
    centered "Ми випустилися зі школи"
    centered "Трохи згодом ми вступили до одного університету"
    centered "Я пішов на менеджера, а Соломія хоче стати вчителькою"
    centered "Пройшло чимало часу, перш ніж я зміг перейти на новий рівень стосунків"


    #---------------------------------------------------------------------------------------------------------------
    #Універ

    # scene bg university_day with fade
    # show solomia2 smile at left with dissolve
    # "Перші дні в університеті були хвилюючими для нас обох."
    # "Ми разом шукали аудиторії, знайомилися з новими людьми, але завжди трималися поруч."
    # s "Пам’ятаєш, як ми боялися запізнитися на першу пару?"
    # h "Я думав, що заблукаю в цих коридорах без тебе."
    # "Ми сміялися, підтримували одне одного, і навіть складні завдання здавалися легшими, коли ми разом."

    # scene bg university_cafe with dissolve
    # show solomia2 normal at left
    # show hero smile at right
    # "Після занять ми часто сиділи в університетському кафе."
    # s "Тут так шумно, але з тобою мені спокійно."
    # h "Я радий, що ми разом навіть у новому місці."
    # "Ми ділилися мріями про майбутнє, обговорювали викладачів і сміялися над кумедними історіями з пар."

    # scene bg university_evening with fade
    # show solomia2 blush at left
    # show hero normal at right
    # "Одного вечора, коли ми разом готувалися до іспиту, Соломія раптом зупинилася і подивилася мені в очі."
    # s "Знаєш, я не уявляю цей університет без тебе."
    # h "Я теж. Ти — моя підтримка і натхнення."
    # "Ми зрозуміли, що наші стосунки стали ще міцнішими. Разом ми долали всі труднощі і раділи кожному дню."


    #---------------------------------------------------------------------------------------------------------------
    #Весілля
    scene bg house2night with dissolve
    show solomia2 blink with dissolve
    "Ми разом сідали на ту ж лавку, біля її будинку"
    "Я дивився на неї, відчуваючи, як у моєму серці знову розцвітає надія"
    "Зараз саме той час, коли ми станемо ще ближче"
    "Я стиснув в кишені кільце, яке зараз подарую своїй коханій"
    h "Соломіє... Я знаю, що ми обидва маємо власні цілі, але хоч би що сталося, я хочу бути з тобою" 
    "Ти — моя мета. Я хочу йти через життя разом з тобою, як партнер, як підтримка"
    "Я повільно дістаю з кишені гарно-оздоблене кільце з голубим сапфіром"
    "Як по класиці, стаю на одне коліно та кажу ті самі слова"
    h "Скажи, ти вийдеш за мене?"
    show solomia2 smiled with dissolve
    "Вона посміхнулася, її очі засвітилися, і вона взяла мою руку"
    s "Я теж хочу цього. З тобою я почуваюся сильною, навіть якщо все навколо здається не таким простим"
    s "Звичайно, я згодна, зараз я нащайсливіша у світі"
    "Ми відчували, як наші серця билися в унісон, і це було більше, ніж просто любов — це була спільна мета, спільне прагнення до чогось кращого"
    "Я обережно одягнув кільце на її безіменний палець"
    jump pre_wedding

label pre_wedding:
    scene black with dissolve

    "Минуло кілька місяців після нашого заручення"

    scene room_heroday with fade

    show solomia2 blink with dissolve

    "Ранок настільки спокійний, що здається, ніби час зупинився"
    "Ми сидимо серед пакетів із магазину, розкладаємо покупки, і сміємося з наших дрібних забудькуватостей"
    s "Ой, ти знову забув купити шоколад, правда ж?" 
    h "Я… я думав про весілля і зовсім випав з реальності"
    show solomia2 smiled at zoomin with dissolve
    s "Тоді доведеться навчити тебе пам’ятати дрібниці"
    h "Тільки якщо ти поруч, щоб нагадувати мені"
    s "Ну ми ж скоро одружимося, тож у мене буде багато можливостей це робити"
    #show solomia2 blink at Position(xpos=0.0) with dissolve
    s "А поки, отримуй свою нагороду за те, що допоміг мені з покупками"
    show solomia2 closed at zoomin with dissolve
    "Вона підходить ближче..."
    s "Це за те, що ти завжди поруч і підтримуєш мене"
    s "І за те, що зробив мене найщасливішою дівчиною на світі"
    s "Ти мій найкращий подарунок"
    "Вона ніжно бере мене за обличчя..."
    s "Я так тебе кохаю, [h]..."
    show solomia2 closed at zoomin with dissolve
    play sound kiss1
    "Її губи торкаються моїх, і я відчуваю, як тепло розливається по всьому тілу"
    scene dark with dissolve
    h "Соломіє..."
    h "Я..."
    h ""
    h "Я не можу уявити своє життя без тебе"
    play sound kiss1
    "Наш поцілунок стає глибшим, і я відчуваю її губи на своїх"
    play sound kiss2
    "Ще один поцілунок..."
    play sound kiss2
    "І ще один..."
    play sound kiss2
    "Ми відчуваємо, як наші серця б'ються в унісон, і це найпрекрасніше відчуття на світі"




    # s "Тобі сьогодні дуже добре, ти так світлишся"
    # h "Тільки коли ти поруч..."
    # "Ми тихо сміємося. Потім сідаємо за стіл, розкладаємо рецепти і обговорюємо меню на свято"
    # s "Я думаю, десерт повинен бути легким. Можемо зробити щось фруктове"
    # h "Так, а я візьму на себе закуски. Разом все буде ідеально"
    # "Поки ми плануємо, я помічаю, як Соломія тихо поправляє свою серветку, як обережно бере чашку з какао, і як щиро посміхається"
    # h "Ти навіть не уявляєш, як мені добре поруч із тобою"
    # s "Мені теж… Кожна хвилина з тобою — особлива"
    # "Ми сидимо поруч, тримаючись за руки, насолоджуючись тишею і теплом цього вечора, плануючи наше маленьке спільне життя"

    jump wedding_scene

