label good_end_right:
    play sound door
    scene room_heronight with dissolve
    "Я радий, що вдалося все залагодити з Соломією"
    "Я ліг на ліжко"
    "Тієї ночі я не міг заснути. Мої думки були переповнені словами Соломії і тим, що вона розповіла мені" 
    "Її важке життя, її боротьба з сімейними проблемами, її рішучість і прагнення вирішити все самотужки..." 
    "Я зрозумів, що ми повинні бути разом. Незважаючи на труднощі, на всі ці перепони, ми повинні підтримувати одне одного"
    scene dark with dissolve

    centered"На наступний день ми зустрілися біля школи, як завжди, але щось було іншим"
    centered"Ми більше не просто друзі, ми стали чимось більшим. У її погляді я бачив ту ж саму турботу"
    centered"Але тепер вона була змішана з впевненістю, якої я не помічав раніше"
    centered"Пройшло пройшов рік"
    centered"Ми випустилися зі школи"
    centered"Трохи згодом ми вступили до одного університету"
    centered"Я пішов на менеджера, а Соломія хоче стати вчителькою"
    centered"Пройшло чимало часу, перш ніж я зміг перейти на новий рівень стосунків"


    #---------------------------------------------------------------------------------------------------------------
    #Універ


    #---------------------------------------------------------------------------------------------------------------
    #Весілля
    scene bg house2night with dissolve
    show solomia2 blink with dissolve
    "Ми разом сідали на ту ж лавку, біля її будинку"
    "Я дивився на неї, відчуваючи, як у моєму серці знову розцвітає надія"
    "Зараз саме той час, коли ми станемо ще ближче"
    "Я стиснув в кишені кільце, яке зараз подарую своїй коханій"
    h "Соломіє... Я знаю, що ми обидва маємо власні цілі, але хоч би що сталося, я хочу бути з тобою" 
    "Ти — моя мета. Я хочу йти через життя разом з тобою, як партнер, як підтримка"
    "Я повільно дістаю з кишені гарно-оздоблене кільце з голубим сапфіром"
    "Як по класиці, стаю на одне коліно та кажу ті самі слова"
    h "Скажи, ти вийдеш за мене?"
    show solomia2 smiled with dissolve
    "Вона посміхнулася, її очі засвітилися, і вона взяла мою руку"
    s "Я теж хочу цього. З тобою я почуваюся сильною, навіть якщо все навколо здається не таким простим"
    s "Звичайно, я згодна, зараз я нащайсливіша у світі"
    "Ми відчували, як наші серця билися в унісон, і це було більше, ніж просто любов — це була спільна мета, спільне прагнення до чогось кращого"
    "Я обережно одягнув кільце на її безіменний палець"
    "Трохи згодом ми зіграли весілля"
    jump wedding_scene

