# Гра починається тут
label start:
    default score = 0

    #Програвання музики в грі
    #Плавне затухання музики - stop music fadeout 1.0

    $ play_random_playlist()


    scene black with dissolve
    centered"Кожен крок, кожен погляд, кожне слово — це вибір. Одні з них зникають, наче слід на воді. Інші залишаються назавжди"
    centered"Людина завжди стоїть перед роздоріжжям. Навіть тоді, коли здається, що дороги немає"
    centered"Одні бояться зробити крок, інші кидаються вперед, не вагаючись. Але рано чи пізно кожен усвідомлює: за вибір доведеться заплатити"
    centered"Чи є правильний вибір? Чи існує дорога без жалю?"
    centered"Настав час вирішувати. Ти готовий поринути де кожен момент може стати початком нової історії?"
    centered"Де серце б’ється швидше від кожного погляду, а думки переплітаються з найглибшими почуттями?"
    centered"Де любов і таємниці чекають на тебе за кожним кутом, і ти не можеш бути впевнений, що буде далі"
    centered"Відкрий двері до світу, в якому ти сам вирішуєш, як розвиватиметься твоя історія"

    scene bg schoolout
    with dissolve
    #монолог головного героя
    "Перед вами моя школа. Я живу в досить невеликому містечку, тому вона є точно не найпрестижнішою"
    "Іноді, коли йду до школи, я згадую, як у дитинстві усе було простішим. Але зараз здається, ніби світ стає тільки сірішим з кожним днем"
    "Хтось сказав таку фразу: {i}\"Школа готує нас до життя в світі, якого не існує\"{/i}"
    "Думаю, це правда"
    "Мені 18, і я не знаю, чим хочу займатися далі. У мене немає амбіцій, немає конкретних мрій. Я веду досить пасивний спосіб життя і просто пливу за течією"
    "Я живу сам. Мати померла, коли мені було шість років. Тоді я ще не до кінця розумів, що відбувається, але цей день залишився в мені назавжди" 
    "Батько… він просто зник. Одного дня сказав, що їде у відрядження, і більше не повернувся. Без жодного пояснення. Без прощання"
    "З тих пір, як померла моя мати, а батько залишив мене, відчуття покинутості стало частиною мого повсякденного життя"
    "Мені пощастило знайти дешеву кімнату в старому будинку. Маленька, тісна, з тонкими стінами і сусідами, які іноді доводять мене до сказу" 
    "Але вона моя. Принаймні, поки я вчасно плачу за оренду"
    "Саме тому я працюю в місцевому магазині. Вистачає на квартиру та їжу. Важко, але жити можна"
    "У мене мало знайомих. Друзів ще менше. Єдина людина, яка була поруч зі мною всі ці роки, — це Соломія" 
    "Вона підтримувала мене, коли не стало матері, і залишалася поруч, навіть коли я сам не знав, чому це робить"
    "Отож, я звичайний школяр, нічим не виділяюсь, друзів не маю й живу як можу"
    "Ось такі у мене думки, кожного разу, коли я йду до школи"

    scene bg schoolcorridor
    with fade

# Цикл для введення коректного імені
while True:
    $ heroname = renpy.input("Як звати головного героя?", length=12, default="", allow="АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя-").strip()

    # Перевірка наявності заборонених слів
    if check_banned(heroname):
        return 0  

    # Перевірка наявності імені
    if heroname == "":
        $ heroname = "Богдан"
        
    "Мама назвала мене [heroname]. Чому саме так – гадки не маю. Але раз уже доводиться з ним жити, то нехай буде"
    
    s "Привітик!"

    "Соломія — єдина, хто мене зрозумів у найтемніші моменти. Коли всі інші зневажали чи просто ігнорували, вона залишалася поруч"
    "Вона – повна моя протилежність. Гарна, розумна, товариська. Люди самі тягнуться до неї. Мабуть, тому мені й не зовсім ясно, чому вона досі витрачає свій час на мене"
    "Та й загалом вона неймовірно добра та чуйна до інших людей. Іноді навіть занадто"
    "Вона рідко показує, що їй щось не подобається. Часто бере на себе більше, ніж потрібно, допомагає всім підряд, навіть коли цього не просять"
    "Іноді мені здається, що вона просто не вміє відмовляти людям. Це виглядає благородно, але, як на мене, жахливо втомлює"

    h "Привітик, Соломіє!"
    show solomia blink
    with dissolve
    if not achievement.has("first"):  # Перевіряємо, чи досягнення ще не здобуте
        achieve first
        play sound achievement
    
    s "Як твій настрій?"
    h "Та все нормально, а у тебе як?"
    s "У мене теж нормально"

    show solomia think
    with dissolve
    s "До речі, у мене є розмова до тебе"
    "Напевно, це щось важливе"
    h "Я уважно слухаю"
    s "Мені потрібна допомога з..."

    "Коли вона робить таке обличчя, це означає, що вона ховає свої почуття"
    s "Деякими плітками"
    hide solomia think
    scene dark
    "…Плітки"
    "Я добре знаю, як це — стати об'єктом чужого язика"
    "Спочатку шепіт за спиною. Потім насмішки. А потім…"
    play sound smeh_tolpa
    centered"Подивіться на нього, та він же невдаха!"
    centered"Ну що розумнику, догрався"
    centered"Тепер і мамаша твоя здохла"
    centered"Так шо катись звідси, лошара"
    "Ці слова, як голки, пронизували мене"
    "Я не пам’ятаю, як усе сталося. Лише глухий шум у вухах і..."

    play sound udar_kulak
    centered"Удар"
    play sound udar_kulak
    centered"І ще"
    play sound udar_kulak
    centered"Я бив і бив його"
    play sound udar_kulak
    centered"Кулаки рухалися самі собою. Кожен удар — мов спроба вирватися з темряви"
    centered"Я бив його, поки все довкола не стало розмитим, поки його обличчя не покрилося кров'ю"
    centered"Ясна річ, після такого мене вигнали зі школи"
    centered"Переїзд став єдиним виходом"
    centered"Тому я і переїхав в інше місто"

    scene bg schoolcorridor
    show solomia think
    s "Тому я хотіла попросити би тебе піти зі мною сьогодні додому, раптом хтось ще причепиться"

    menu compliment:
        "Ваші дії?"
        "Допомогти їй":
            h "Звичайно, я тільки радий буду"
            show solomia shy with dissolve 
            s "Ой, дякую, тоді зустрінемося після уроків"
            jump good_end
            return

        "Відмовитися":
            h "Вибач, я не маю на це часу"
            show solomia confident with dissolve 
            play sound surp
            s "Ну ти і байдужий, та ну тебе!"
            hide solomia confident with dissolve 
            "Ви бачите, як вона йде геть. Ви відчуваєте, що зробили неправильно"
            jump bad
            return
