# Гра починається тут. 
label start:

    scene bg schoolcorridor
    with fade

    #Програвання музики в грі
    #Плавне затухання музики - stop music fadeout 1.0
    play music calmmus

    #Код який виводить текст та вводить ім'я персонажа в змінну, обмежує ввід символів та максимальну довжину імені
    $ heroname = renpy.input ("Як звати головного героя?", length=12, default="Богдан", allow="АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя-").strip()

    #Код перевірки значення змінної імені. Якщо ім'я немає, то воно автоматично заповниться
    if heroname == "":
        $ heroname = "Богдан"

    #монолог головного героя
    "[heroname] - молодий студент, який вчиться"

    h "Привітик, Соломіє!"

    show solomia smiled
    with dissolve
    
    s "Привітик!"

    show solomia blink
    with dissolve 
    
    s "Як твій настрій?"

    "Ви бачите, що у неї чудовий настрій, а також нова зачіска"

    menu compliment:
        "Ваші дії?"
        "Похвалити її":
            h "Ти така гарна сьогодні, нова зачіска у тебе?"
            show solomia shy with dissolve 
            s "Ой, дякую, так і є"
            jump good_end
            return

        "Нагрубити їй":
            h "Відчепися від мене!"
            show solomia confident with dissolve 
            play sound surp
            s "Ну ти і злюка, ну й не треба ти мені!"
            "Ви бачите, як вона йде геть. Ви невдаха"
            jump bad_end
            return

label good_end:
    "Ви думаєте, яка ж вона красуня"

    show solomia smiled
    with dissolve

    s "Які в тебе плани на сьогодні?"

    h "Я не впевнений, я хотів би пошвидше прийти додому й пограти в ігри"

    s"От завжди ти так! Подумай хоч трохи про себе, замучиш ти себе таким способом життя"

    h"Хе-хе"

    "Я завжди надавав перевагу віртуальному світу, а не реальному"

    "Реальність занадто сувора"

    show solomia shy
    with dissolve

    s"Ну..Ммм"

    "Я подивився на неї з подивом, така милаха"

    s"Ти підеш зі мною додому?"

    menu proposition:
        "Погодитися":
            "Чом би й ні, все одно нічим мені зайнятися"
            jump accept
            return

        "Відмовитися":
            "Піду краще в ігри пограю"
    jump bad_end
    return

label accept:
    h"Звичайно!"
    show solomia normal
    with dissolve
    s"Тоді чекаю тебе біля школи після уроків"
    "Її посмішка збила мене з пантелику"
    "Геть дурні думки"
    "Соломія пішла до класу"
    hide solomia shy
    with dissolve
    "Мабуть, варто поспішити. Не впевнений, що я правильно зробив"
    return

label bad_end:
    "Ви посварилися з Соломією й до кінця життя жили самотньо"
    "Ви просто тотальний невдаха"

    # На цьому гра закінчується.

    return
